{
  "landingpage": {
    "whyme": "Warum ich",
    "skills": "Fähigkeiten",
    "projects": "Projekte",
    "contact": "Kontakt"
  },

  "why_me": {
    "whyme": "Warum ich",
    "location": "<span class='bg_blue'>Mein</span> Wohnsitz ist in Berlin <span class='bg_blue'>...</span>",
    "remote": "<span class='bg_blue'>Ich</span> arbeite auch Remote <span class='bg_blue'>...</span>",
    "relocate": "<span class='bg_blue'>Ich</span> ziehe auch nach Bayern <span class='bg_blue'>...</span>",
    "text": "Ich bin motiviert, ständig neue Technologien zu erlernen und mich weiterzuentwickeln. Meine Fähigkeit, komplexe Probleme zu lösen und meine Leidenschaft für das Programmieren machen mich zu einem wertvollen Mitglied für Ihr Team."
  },

  "my_skills": {
    "myskills": "Meine Fähigkeiten",
    "learningHeadline": "Ich lerne derzeit",
    "learningContent": "Um motiviert zu bleiben und meine IT-Kenntnisse zu erweitern, sind eine strategische Herangehensweise, eine neugierige Denkweise und die Bereitschaft zum lebenslangen Lernen erforderlich."
  },

  "reviews": {
    "headline_one": "Brauchen Sie einen Teamplayer? ",
    "headline_two": " Hören Sie, was meine Kollegen über mich sagen",
    "review_one_name": "Dzmitry Stashkevich",
    "review_one_project": "Kochwelt",
    "review_one_review": "Martin beeindruckte mit seiner schnellen Problemerkennung und sauberem Code im Projekt „Kochwelt“. Er erstellte die Rezeptseite und machte sie voll funktionsfähig. Seine klaren Aussagen und seine Kommunikationsfähigkeit haben das Team unterstützt. Ich würde jederzeit wieder gerne mit ihm zusammenarbeiten.",
    "review_two_name": "Michael Spari",
    "review_two_project": "Kochwelt",
    "review_two_review": "Martin war ein Top-Teamkollege bei DA. Sein positives Engagement und seine Bereitschaft, Verantwortung zu übernehmen, haben sehr dazu beigetragen, dass wir unsere Ziele erreicht haben.",
    "review_three_name": "Philipp Franke",
    "review_three_project": "Join",
    "review_three_review": "Martin ist ein wertvoller Teamkollege, der mit seiner Gewissenhaftigkeit und seinem Engagement das Projekt maßgeblich vorangebracht hat. Er zeigte stets Eigeninitiative und übernahm auch Aufgaben, die noch offen waren. Sein konstruktives und kritisches Feedback half dem Team sich kontinuierlich zu verbessern. Dabei blieb er offen für Optimierungsvorschläge und nahm diese als Chance zur Weiterentwicklung an. Auch bei Fehlermeldungen ließ er sich nicht entmutigen, sondern bewahrte seinen Humor und die Freude an der Arbeit.",
    "review_four_name": "Normann Blum",
    "review_four_project": "Join",
    "review_four_review": "Mit Martin zu arbeiten, war eine super Erfahrung! Er arbeitet sehr präzise und hat ein tolles Gespür dafür, komplexe Probleme strukturiert zu lösen. Hinzu kommt, dass er ein echter Teamplayer ist – offen, humorvoll und immer bereit, sein Wissen zu teilen. Seine analytische Denkweise und sein lösungsorientiertes Arbeiten haben unsere Zusammenarbeit extrem bereichert.",
    "review_five_name": "Dominik Marnet",
    "review_five_project": "Join",
    "review_five_review": "Die Zusammenarbeit mit Martin war von Tag eins an sehr gut und effizient. Man kann ohne Zweifel sagen, dass er ein echtes Arbeitstier ist, wodurch er einen Großteil der jüngeren Teammitglieder mit Leichtigkeit übertrifft. Martin hat eine sehr sympathische Umgangsart und hat mit seinen umfassenden Coding-Kenntnissen und seiner professionellen Vorgehensweise wesentlich zum Erfolg unseres Projekts beigetragen. Einen besseren Teamplayer kann man sich nicht wünschen!"
  },

  "contact": {
    "contact_headline": "Kontakt",
    "contact_headline_two": "Lassen Sie uns zusammen arbeiten!",
    "contact_content": "Sie sind sich noch nicht sicher, ob ich DER Richtige für Ihr Projekt bin?<br>Egal, ob Ihr Projekt die Entwicklung einer neuen Anwendung, die Aktualisierung vorhandener Systeme oder die Implementierung robuster Cybersicherheitsmaßnahmen umfasst, ich verfüge über das technische Know-how und die Problemlösungskompetenz, um Ihnen erfolgreiche Ergebnisse zu präsentieren.<br>Nehmen Sie gerne mit mir Kontakt auf, damit wir gemeinsam alles besprechen können.",
    "contact_phone": "Tel: ",
    "contact_mail": "E-Mail: ",
    "contact_name": "Ihr Name ",
    "contact_name_error": "Ihr Name ist erforderlich: ",
    "contact_Email": "Ihre E-Mail ",
    "contact_mail_error": "Ihre E-Mail ist erforderlich: ",
    "contact_message": "Ihre Nachricht ",
    "contact_message_error": "Ihre Nachricht ist erforderlich: ",
    "privacy_policy_message_one": "Ich habe die ",
    "privacy_policy_message_two": " gelesen und stimme der Verarbeitung meiner Daten wie beschrieben zu.",
    "privacy_policy_message_error": "Bitte akzeptieren Sie die Datenschutzerklärung.",
    "contact_btn_send": "Senden",
    "contact_success_message": "Ihre Nachricht wurde erfolgreich gesendet!"
  },

  "title": {
    "headline": "Meine Projekte",
    "project1": "1. Projekt",
    "project2": "2. Projekt",
    "project3": "3. Projekt",
    "project4": "4. Laufendes Projekt",
    "project5": "5. Projekt",
    "project6": "6. Projekt",
    "project7": "7. Projekt",
    "frontend_projects": "Frontend",
    "backend_projects": "Backend"
  },

  "project": {
    "project_title_pokedex": "Pokedex",
    "project_about_pokedex": "Über das Projekt",
    "project_duration_pokedex": "Dauer: 1 Woche",
    "project_about_text_pokedex": "Das Pokedex-Projekt ist eine Sammlung und Dokumentation von Pokémon, die Informationen wie Fähigkeiten, Typen, Entwicklung und Herkunft jedes Pokémon umfasst.",
    "project_organized_pokedex": "So habe ich meinen Arbeitsablauf organisiert",
    "project_organized_text_pokedex": "1. Was soll mein Pokedex beinhalten? <br>2. Woher bekomme ich die Daten für mein Pokedex? <br>3. Wie soll die Benutzeroberfläche aussehen. Wie sollen die Informationen angezeigt werden? Wie navigiert der Benutzer durch den Pokedex? <br>4. Suchfunktion und Filter: eine Suchfunktion implementieren, um Pokémon nach Namen zu finden.",
    "project_experience_pokedex": "Was habe ich gelernt?",
    "project_experience_text_pokedex": "Die Aufgabe war es, ein Pokémon-Trainer-Register zu entwickeln, dabei zu lernen, APIs zu nutzen, um Pokémon-Eigenschaften abzurufen und Systeme kompatibel zu gestalten.",
    "icons_container_headline": "Technologien",
    "link_live_pokedex": "https://www.pokedex.martin-bock.info",
    "link_github_pokedex": "https://github.com/MartinBock1/Pokedex",

    "project_title_game": "El Pollo Loco",
    "project_about_game": "Über das Projekt",
    "project_duration_game": "Dauer: 3 Wochen",
    "project_about_text_game": "Spring-, Lauf- und Wurfspiel mit objektorientiertem Ansatz. Hilf Pepe, Münzen und Tabasco-Salsa zu finden, um gegen die verrückte Henne zu kämpfen.",
    "project_organizsed_game": "So habe ich meinen Arbeitsablauf organisiert",
    "project_organized_text_game": "Nach Erstellen des Grundgerüstes nach Vorgabe, Weiterentwicklung des Canvas mit den neu erlernten Fähigkeiten.",
    "project_experience_game": "Was habe ich gelernt?",
    "project_experience_text_game": "Erlernen & Anwendung fortgeschrittener Konzepte wie Objektorientierung (OOP), Kennenlernen und Verwendung von BrowserEvents, Vertiefung von JavaScript Kenntnissen",
    "link_live_game": "https://www.elpolloloco.martin-bock.info",
    "link_github_game": "https://github.com/MartinBock1/El-Pollo-Loco",

    "project_title_join": "Join",
    "project_about_join": "Über das Projekt",
    "project_duration_join": "Dauer: 5 Wochen",
    "project_about_text_join": "Aufgabenmanager nach dem Vorbild des Kanban-Systems. Erstellen und organisieren Sie Aufgaben mit Hilfe von Drag-and-Drop-Funktionen, weisen Sie Benutzer und Kategorien zu.",
    "project_organized_join": "So habe ich meinen Arbeitsablauf organisiert",
    "project_organized_text_join": "Das Projekt wurde in 3 Sprints gesplittet. Die Aufgaben wurden dann in einem Kanban-Board aufgeteilt, sodass jeder Aufgaben alleine zu bewältigen hatte, es wurden aber auch einige Aufgaben in Gruppenarbeit erledigt.",
    "project_experience_join": "Meine Erfahrung in der Gruppenarbeit",
    "project_experience_text_join": "Für mein Abschlussprojekt an der Developer Akademie verwendeten wir mit 4 Kollegen Angular und Firebase (Angular Fire). Meine Hauptaufgaben umfassten die Eingabe und Verarbeitung und Speicherung von Kontaktdaten, sowie neuen Tasks.  Darüber hinaus die Nutzung von Firebase zur Authentifizierung und Datenspeicherung.",
    "link_live_join": "https://www.join.martin-bock.info",
    "link_github_join": "https://github.com/MartinBock1/Join",

    "project_title_ongoinig": "Laufendes Projekt",
    "project_about_ongoinig": "Über das Projekt",
    "project_duration_ongoinig": "",
    "project_about_text_ongoinig": "Ich arbeite derzeit an der Entwicklung eines einfachen Customer Relationship Management-Systems mit CRUD-Funktionalität. Das ist für mich sowohl spannend als auch herausfordernd. Bei meiner Arbeit liegt der Schlüssel zum Erfolg in einer guten Planung und Ausführung. Aufgaben mit Drag & Drop-Funktionen ordnen, Benutzer und Kategorien zuweisen.",
    "project_organized_ongoinig": "",
    "project_organized_text_ongoinig": "",
    "project_experience_ongoinig": "",
    "project_experience_text_ongoinig": "",
    "link_live_ongoinig": "",
    "link_github_ongoinig": "",

    "project_title_kanmind": "KanMind",
    "project_about_kanmind": "Über das Projekt",
    "project_duration_kanmind": "Dauer: 2 Wochen",
    "project_about_text_kanmind": "KanMind ist eine auf der Kanban-Methodik basierende Projektmanagement-Anwendung, die über eine RESTful API gesteuert wird. Sie ermöglicht es Teams, Projekte in Boards zu organisieren, Tasks mit Status, Priorität und Zuweisungen zu verwalten und über Kommentare zusammenzuarbeiten. Die API deckt die gesamte Logik von der Benutzerauthentifizierung über die Board- und Task-Verwaltung bis hin zur kollaborativen Kommunikation ab.",
    "project_organized_kanmind": "So habe ich meinen Arbeitsablauf organisiert",
    "project_organized_text_kanmind": "Ich habe den Arbeitsablauf logisch nach den Abhängigkeiten der Datenmodelle strukturiert, beginnend mit der fundamentalen Benutzerauthentifizierung für Registrierung und Login. Darauf aufbauend entwickelte ich die komplette Logik für die Boards, da diese die zentrale Organisationseinheit bilden. Zum Schluss habe ich die davon abhängigen Funktionen für Tasks und Kommentare implementiert, um den gesamten Workflow von der Anmeldung bis zur Zusammenarbeit an einer Aufgabe abzudecken.",
    "project_experience_kanmind": "Was habe ich gelernt?",
    "project_experience_text_kanmind": "Bei der Entwicklung dieses Backends habe ich gelernt, eine komplexe und sichere RESTful API von Grund auf zu konzipieren und nach Best Practices umzusetzen. Ein zentraler Fokus lag auf der Implementierung eines robusten Authentifizierungs- und Berechtigungssystems, das den Zugriff auf Ressourcen präzise nach Benutzerrollen wie Eigentümer oder Mitglied steuert. Zudem habe ich meine Fähigkeiten in der Modellierung von Datenstrukturen mit komplexen Beziehungen und der Erstellung effizienter Datenbankabfragen vertieft.",
    "link_live_kanmind": "https://www.kanmind.martin-bock.info",
    "link_github_kanmind": "https://github.com/MartinBock1/KanMind-Backend",

    "project_title_coderr": "Coderr",
    "project_about_coderr": "Über das Projekt",
    "project_duration_coderr": "Dauer: 4 Wochen",
    "project_about_text_coderr": "Ich habe das Backend für 'Coderr', eine Freelancer- und Service-Plattform, entwickelt, das als zentrale Schnittstelle zwischen Anbietern und Kunden fungiert. Die API implementiert eine komplette Geschäftslogik für die Verwaltung von Profilen, mehrstufigen Angeboten, Bestellungen und einem Bewertungssystem. Ein Kernmerkmal ist das detaillierte, rollenbasierte Berechtigungssystem, das die Integrität und Sicherheit aller Aktionen auf der Plattform gewährleistet.",
    "project_organized_coderr": "So habe ich meinen Arbeitsablauf organisiert",
    "project_organized_text_coderr": "Ich habe den gesamten Entwicklungsprozess konsequent nach der Methodik des Test-Driven Development (TDD) organisiert. Für jede Funktion – von der Benutzerauthentifizierung bis zur Bestelllogik – schrieb ich zuerst einen fehlschlagenden Test, der das erwartete Verhalten und die Berechtigungen präzise definierte. Dieser Ansatz zwang mich, die Anwendungslogik aus der Perspektive des Nutzers zu entwerfen und führte organisch zu einer robusten, gut getesteten und wartbaren Codebasis.",
    "project_experience_coderr": "Was habe ich gelernt?",
    "project_experience_text_coderr": "Durch die konsequente Anwendung von Test-Driven Development habe ich gelernt, wie man eine komplexe Geschäftslogik in eine saubere und intuitive API-Struktur überführt. Ich habe meine Fähigkeiten im Umgang mit verschachtelten Datenstrukturen bei der Angebotserstellung sowie in der Optimierung von Datenbankabfragen für anspruchsvolle Filter- und Aggregations-Endpunkte entscheidend vertieft. Letztendlich hat mir das Projekt gezeigt, wie TDD nicht nur die Codequalität sichert, sondern auch zu einem besseren und durchdachteren API-Design führt.",
    "link_live_coderr": "https://www.coderr.martin-bock.info",
    "link_github_coderr": "https://github.com/MartinBock1/Coderr",

    "project_title_videoflix": "Videoflix",
    "project_about_videoflix": "Über das Projekt",
    "project_duration_videoflix": "Dauer: 5 Wochen",
    "project_about_text_videoflix": "",
    "project_organized_videoflix": "So habe ich meinen Arbeitsablauf organisiert",
    "project_organized_text_videoflix": "",
    "project_experience_videoflix": "Was habe ich gelernt?",
    "project_experience_text_videoflix": "",
    "link_live_videoflix": "https://www.martin-bock.info",
    "link_github_videoflix": "https://github.com/MartinBock1/"
  },

  "footer": {
    "legal_notice": "Impressum",
    "privacy_policy": "Datenschutzerklärung"
  },

  "legalnotices": {
    "headline": "Impressum",
    "name": "Martin Bock<br>Becherweg 30<br>13407 Berlin<br>Deutschland",
    "contact_headline": "Kontaktmöglichkeiten",
    "contact_mail_phone": "Telefon: +49 30 81473698<br>E-Mail-Adresse: kontakt&#64;martin-bock.info",
    "picture_headline": "Bildernachweis",
    "picture_text": "<strong>Die Bilderrechte liegen bei: </strong>",
    "legal_source": "Quelle: Erstellt mit dem <a href='https://www.adsimple.de/impressum-generator/' title='Impressum Generator Deutschland von AdSimple'>Impressum Generator Deutschland</a> von AdSimple"
  },

  "privacypolicy": {
    "headline": "Datenschutzerklärung",
    "text_block_one": "Personenbezogene Daten (nachfolgend zumeist nur „Daten“ genannt) werden von uns nur im Rahmen der Erforderlichkeit sowie zum Zwecke der Bereitstellung eines funktionsfähigen und nutzerfreundlichen Internetauftritts, inklusive seiner Inhalte und der dort angebotenen Leistungen, verarbeitet. <br> Gemäß Art. 4 Ziffer 1. der Verordnung (EU) 2016/679, also der Datenschutz-Grundverordnung (nachfolgend nur „DSGVO“ genannt), gilt als „Verarbeitung“ jeder mit oder ohne Hilfe automatisierter Verfahren ausgeführter Vorgang oder jede solche Vorgangsreihe im Zusammenhang mit personenbezogenen Daten, wie das Erheben, das Erfassen, die Organisation, das Ordnen, die Speicherung, die Anpassung oder Veränderung, das Auslesen, das Abfragen, die Verwendung, die Offenlegung durch Übermittlung, Verbreitung oder eine andere Form der Bereitstellung, den Abgleich oder die Verknüpfung, die Einschränkung, das Löschen oder die Vernichtung. <br>Mit der nachfolgenden Datenschutzerklärung informieren wir Sie insbesondere über Art, Umfang, Zweck, Dauer und Rechtsgrundlage der Verarbeitung personenbezogener Daten, soweit wir entweder allein oder gemeinsam mit anderen über die Zwecke und Mittel der Verarbeitung entscheiden. Zudem informieren wir Sie nachfolgend über die von uns zu Optimierungszwecken sowie zur Steigerung der Nutzungsqualität eingesetzten Fremdkomponenten,     soweit hierdurch Dritte Daten in wiederum eigener Verantwortung verarbeiten.",
    "structure": " Unsere Datenschutzerklärung ist wie folgt gegliedert:<br>I. Informationen über uns als Verantwortliche<br>II. Rechte der Nutzer und Betroffenen<br>III. Informationen zur Datenverarbeitung",
    "structure_one_headline": "I. Informationen über uns als Verantwortliche",
    "structure_one": "Verantwortlicher Anbieter dieses Internetauftritts im datenschutzrechtlichen Sinne ist:<br>Martin Bock<br>Becherweg 30<br>13407 Berlin<br><br>Telefon: +49 30 81473698<br>E-Mail: kontakt&#64;martin-bock.info",
    "structure_two_headline": "II. Rechte der Nutzer und Betroffenen",
    "structure_two": "Mit Blick auf die nachfolgend noch näher beschriebene Datenverarbeitung haben die Nutzer und Betroffenen das Recht<br><ul><li>auf Bestätigung, ob sie betreffende Daten verarbeitet werden, auf Auskunft über die verarbeiteten Daten, auf weitere Informationen über die Datenverarbeitung sowie auf Kopien der Daten (vgl. auch Art. 15 DSGVO)<li>auf Berichtigung oder Vervollständigung unrichtiger bzw. unvollständiger Daten (vgl. auch Art. 16 DSGVO)</li><li>auf unverzügliche Löschung der sie betreffenden Daten (vgl. auch Art. 17 DSGVO), oder, alternativ,soweit eine weitere Verarbeitung gemäß Art. 17 Abs. 3 DSGVO erforderlich ist, auf Einschränkung der Verarbeitung nach Maßgabe von Art. 18 DSGVO</li><li> auf Erhalt der sie betreffenden und von ihnen bereitgestellten Daten und auf Übermittlung dieser Daten an andere Anbieter/Verantwortliche (vgl. auch Art. 20 DSGVO)</li><li> auf Beschwerde gegenüber der Aufsichtsbehörde, sofern sie der Ansicht sind, dass die sie betreffenden Daten durch den Anbieter unter Verstoß gegen datenschutzrechtliche Bestimmungen verarbeitet werden (vgl. auch Art. 77 DSGVO).</li></li></ul><br>Darüber hinaus ist der Anbieter dazu verpflichtet, alle Empfänger, denen gegenüber Daten durch den Anbieter offengelegt worden sind, über jedwede Berichtigung oder Löschung von Daten oder die Einschränkung der Verarbeitung, die aufgrund der Artikel 16, 17 Abs. 1, 18 DSGVO erfolgt, zu unterrichten. Diese Verpflichtung besteht jedoch nicht, soweit diese Mitteilung unmöglich oder mit einem unverhältnismäßigen Aufwand verbunden ist. Unbeschadet dessen hat der Nutzer ein Recht auf Auskunft über diese Empfänger.<br><strong> Ebenfalls haben die Nutzer und Betroffenen nach Art. 21 DSGVO das Recht auf Widerspruch gegen die künftige Verarbeitung der sie betreffenden Daten, sofern die Daten durch den Anbieter nach Maßgabe von Art. 6 Abs. 1 (lit. f) DSGVO verarbeitet werden. Insbesondere ist ein Widerspruch gegen die Datenverarbeitung zum Zwecke der Direktwerbung statthaft.</strong>",
    "structure_three_headline": "III. Informationen zur Datenverarbeitung",
    "structure_three": "Ihre bei Nutzung unseres Internetauftritts verarbeiteten Daten werden gelöscht oder gesperrt, sobald der Zweck der Speicherung entfällt, der Löschung der Daten keine gesetzlichen Aufbewahrungspflichten entgegenstehen und nachfolgend keine anderslautenden Angaben zu einzelnen Verarbeitungsverfahren gemacht werden.",
    "contact_headline": "Kontaktanfragen / Kontaktmöglichkeit",
    "contact": "Sofern Sie per Kontaktformular oder E-Mail mit uns in Kontakt treten, werden die dabei von Ihnen angegebenen Daten zur Bearbeitung Ihrer Anfrage genutzt. Die Angabe der Daten ist zur Bearbeitung und Beantwortung Ihre Anfrage erforderlich – ohne deren Bereitstellung können wir Ihre Anfrage nicht oder allenfalls eingeschränkt beantworten.<br>Rechtsgrundlage für diese Verarbeitung ist Art. 6 Abs. 1 (lit. b) DSGVO.<br>Ihre Daten werden gelöscht, sofern Ihre Anfrage abschließend beantwortet worden ist und der Löschung keine gesetzlichen Aufbewahrungspflichten entgegenstehen, wie bspw. bei einer sich etwaig anschließenden Vertragsabwicklung.",
    "linkedin_headline": "LinkedIn",
    "linkedin": "LinkedIn Ireland Unlimited Company, Wilton Plaza, Wilton Place, Dublin 2, Irland, ein Tochterunternehmen der LinkedIn Corporation, 1000 W. Maude Avenue, Sunnyvale, CA 94085 USA.<br> Datenschutzerklärung: <a href='https://www.linkedin.com/legal/privacy-policy' target='_blank' rel='noopener nofollow'>https://www.linkedin.com/legal/privacy-policy</a>",
    "lawer": "<a href='https://www.generator-datenschutzerklärung.de' target='_blank' rel='noopener'>Muster-Datenschutzerklärung</a> der <a href='https://www.bewertung-löschen24.de' rel='nofollow noopener' target='_blank'>Anwaltskanzlei Weiß &amp; Partner</a>"
  }
}
