{
  "landingpage": {
    "whyme": "Why me",
    "skills": "Skills",
    "projects": "Projects",
    "contact": "Contact"
  },

  "why_me": {
    "whyme": "Why me",
    "location": "<span class='bg_blue'>I am</span> located in Berlin <span class='bg_blue'>...</span>",
    "remote": "<span class='bg_blue'>I am</span> open to work remote <span class='bg_blue'>...</span>",
    "text": "I am motivated to continuously learn new technologies and develop myself. My ability to solve complex problems and my passion for programming make me a valuable member for your team."
  },

  "my_skills": {
    "myskills": "My Skills",
    "learningHeadline": "I am currently learning",
    "learningContent": "Staying motivated to expand my IT skills requires a strategic approach, a curious mindset, and a commitment to lifelong learning."
  },

  "reviews": {
    "headline_one": "Need a teamplayer? ",
    "headline_two": "Here what my colleagues said about me"
  },

  "contact": {
    "contact_headline": "Contact me",
    "contact_headline_two": "Let us work together!",
    "contact_content": "Still not sure if I am the right person for your project?<br>Whether your project involves developing a new application, upgrading existing systems, or implementing robust cybersecurity measures, I have the technical acumen and problem-solving skills to ensure successful outcomes.<br>Please feel free to contact me so that we can discuss everything together.",
    "contact_phone": "Tel: ",
    "contact_mail": "E-mail: ",
    "contact_name": "Your name ",
    "contact_name_error": "Your Name is required: ",
    "contact_Email": "Your E-mail ",
    "contact_mail_error": "Your Email is required: ",
    "contact_message": "Your message ",
    "contact_message_error": "Your Message is required: ",
    "privacy_policy_message_one": "I've read the ",
    "privacy_policy_message_two": " and agree to the processing of my data as outlined.",
    "privacy_policy_message_error": "Please accept the privacy policy.",
    "contact_btn_send": "Send",
    "contact_success_message": "Your message was sent successfully!"
  },

  "title": {
    "nav_title": "4. Ongoinig Project"
  },

  "project": {
    "project_about_pokedex": "About the Project",
    "project_duration_pokedex": "Duration: 1 week",
    "project_about_text_pokedex": "The Pokedex Project is a collection and documentation of Pokémon, including information such as abilities, types, evolution, and origin of each Pokémon.",
    "project_organised_pokedex": "How I have organised my work process",
    "project_organised_text_pokedex": "1. What should my Pokedex contain? <br>2. Where do I get the data for my Pokedex? <br>3. What should the user interface look like. How should the information be displayed? How does the user navigate through the Pokedex? <br>4. Search function and filters: implement a search function to find Pokémon by name.",
    "project_experience_pokedex": "What have I learned?",
    "project_experience_text_pokedex": "The task was to develop a Pokémon trainer registry, learning how to use APIs to retrieve Pokémon characteristics and making systems compatible.",
    "icons_container_headline": "Technologies",
    "link_live_pokedex": "https://www.pokedex.martin-bock.info",
    "link_github_pokedex": "https://github.com/MartinBock1/Pokedex",

    "project_about_game": "About the Project",
    "project_duration_game": "Duration: 3 weeks",
    "project_about_text_game": "Jump, run and throw game based on object-oriented approach. Help Pepe to find coins and tabasco salsa to fight against the crazy hen.",
    "project_organised_game": "How I have organised my work process",
    "project_organised_text_game": "After creating the basic framework as specified, further develop the canvas with the newly learned skills.",
    "project_experience_game": "What have I learned?",
    "project_experience_text_game": "Learning & applying advanced concepts such as object orientation (OOP), getting to know and using browser events, deepening Java Script knowledge",
    "link_live_game": "https://www.elpolloloco.martin-bock.info",
    "link_github_game": "https://github.com/MartinBock1/El-Pollo-Loco",

    "project_about_join": "About the Project",
    "project_duration_join": "Duration: 3 weeks",
    "project_about_text_join": "This App is a Slack Clone App. It revolutionizes team communication and collaboration with its intuitive interface, real-time messaging, and robust channel organization.",
    "project_organised_join": "How I have organised my work process",
    "project_organised_text_join": "...",
    "project_experience_join": "My group work experience",
    "project_experience_text_join": "For my final project at the Developer Akademie, with 3 colleagues, we used Angular and Firebase (Angular Fire). My main tasks included implementing file uploads, structuring the Firebase database, while utilizing Firebase for authentication and data storage.",
    "link_live_join": "",
    "link_github_join": "",

    "project_about_ongoinig": "About the Project",
    "project_duration_ongoinig": "",
    "project_about_text_ongoinig": "I am currently working on developing a Simple Customer Relationship Management system working with CRUD functionality. This is for me both exciting and challenging. In my work the key to success lies in a good planning and execution.ize tasks using drag and drop functions, assign users and categories. ",
    "project_organised_ongoinig": "",
    "project_organised_text_ongoinig": "",
    "project_experience_ongoinig": "",
    "project_experience_text_ongoinig": "",
    "link_live_ongoinig": "",
    "link_github_ongoinig": ""
  },

  "footer": {
    "legal_notice": "Legal Notice",
    "privacy_policy": "Privacy Policy"
  },

  "legalnotices": {
    "headline": "Legal Notice",
    "name": "Martin Bock<br>Becherweg 30<br>13407 Berlin<br>Germany",
    "contact_headline": "Contact",
    "contact_mail_phone": "phone: +49 30 81473698<br>email-Adress: kontakt&#64;martin-bock.info",
    "picture_headline": "Image credits",
    "picture_text": "<strong>The image rights are held by: </strong>",
    "legal_source": "Source: Created with the <a href='https://www.adsimple.de/impressum-generator/' title='Impressum Generator Deutschland von AdSimple'>Legal Notice Generator Germany</a> from AdSimple"
  },

  "privacypolicy": {
    "headline": "Privacy Policy",
    "text_block_one": "Personal data (usually referred to just as „data“ below) will only be processed by us to the extent necessary and for the purpose of roviding a functional and user-friendly website, including its contents, and the services offered there. Per Art. 4 No. 1 of Regulation (EU) 2016/679, i.e.the General Data Protection Regulation (hereinafter referred to as the „GDPR“), „processing“ refers to any operation or set of operations such as collection, recording, organization, structuring, storage, adaptation, alteration, retrieval, consultation, use, disclosure by transmission, dissemination,or otherwise making available, alignment, or combination, restriction, erasure, or destruction performed on personal data, whether by automated means or not. The following privacy policy is intended to inform you in particular about the type, scope, purpose, duration, and legal basis for the processing of such data either under our own control or in conjunction with others. We also inform you below about the third-party components we use to optimize our website and improve the user experience which may result in said third parties also processing data they collect and control.",
    "structure": "Our privacy policy is structured as follows:<br>I. Information about us as controllers of your data<br>II. The rights of users and data subjects<br>III. Information about the data processing",
    "structure_one_headline": "I. Information about us as controllers of your data",
    "structure_one": "The party responsible for this website (the „controller“) for purposes of data protection law is:<br>Martin Bock<br>Becherweg 30<br>13407 Berlin<br><br>Telefon: +49 30 81473698<br>E-Mail: kontakt&#64;martin-bock.info",
    "structure_two_headline": "II. The rights of users and data subjects",
    "structure_two": "With regard to the data processing to be described in more detail below, users and data subjects have the right<br><ul><li>to confirmation of whether data concerning them is being processed, information about the data being processed, further information about the nature of the data processing, and copies of the data (cf. also Art. 15 GDPR)</li><li>to correct or complete incorrect or incomplete data (cf. also Art. 16 GDPR)</li><li>to the immediate deletion of data concerning them (cf. also Art. 17 DSGVO), or, alternatively, if further processing is necessary as stipulated in Art. 17 Para. 3 GDPR, to restrict said processing per Art. 18 GDPR</li><li>to receive copies of the data concerning them and/or provided by them and to have the same transmitted to other providers/controllers (cf. also Art. 20 GDPR)</li><li>to file complaints with the supervisory authority if they believe that data concerning them is being processed by the controller in breach of data protection provisions (see also Art. 77 GDPR).</li></ul><br>In addition, the controller is obliged to inform all recipients to whom it discloses data of any such corrections, deletions, or restrictions placed on processing the same per Art. 16, 17 Para. 1, 18 GDPR. However, this obligation does not apply if such notification is impossible or involves a disproportionate effort. Nevertheless, users have a right to information about these recipients.<br><strong>Likewise, under Art. 21 GDPR, users and data subjects have the right to object to the controller’s future processing of their data pursuant to Art. 6 Para. 1 (lit. f) GDPR. In particular, an objection to data processing for the purpose of direct advertising is permissible.</strong>",
    "structure_three_headline": "III. Information about the data processing",
    "structure_three": "Your data processed when using our website will be deleted or blocked as soon as the purpose for its storage ceases to apply, provided the deletion of the same is not in breach of any statutory storage obligations or unless otherwise stipulated below.",
    "contact_headline": "Contact",
    "contact": "If you contact us via email or the contact form, the data you provide will be used for the purpose of processing your request. We must have this data in order to process and answer your inquiry; otherwise we will not be able to answer it in full or at all.<br>The legal basis for this data processing is Art. 6 Para. 1 lit. b) GDPR.<br>Your data will be deleted once we have fully answered your inquiry and there is no further legal obligation to store your data, such as if an order or contract resulted therefrom.",
    "linkedin_headline": "LinkedIn",
    "linkedin": "LinkedIn Ireland Unlimited Company, Wilton Plaza, Wilton Place, Dublin 2, Irland, a subsidiary of LinkedIn Corporation, 1000 W. Maude Avenue, Sunnyvale, CA 94085 USA.<br> Privacy Policy: <a href='https://www.linkedin.com/legal/privacy-policy' target='_blank' rel='noopener nofollow'>https://www.linkedin.com/legal/privacy-policy</a>",
    "lawer": "<a href='https://www.generator-datenschutzerklärung.de' target='_blank' rel='noopener'>Model Data Protection Statement</a> der <a href='https://www.bewertung-löschen24.de' rel='nofollow noopener' target='_blank'>Anwaltskanzlei Weiß &amp; Partner</a>"
  }
}
