{
  "landingpage": {
    "whyme": "Why me",
    "skills": "Skills",
    "projects": "Projects",
    "contact": "Contact"
  },

  "why_me": {
    "whyme": "Why me",
    "location": "<span class='bg_blue'>I am</span> located in Berlin <span class='bg_blue'>...</span>",
    "remote": "<span class='bg_blue'>I am</span> open to work remote <span class='bg_blue'>...</span>",
    "relocate": "<span class='bg_blue'>I would </span> relocate to Bavaria <span class='bg_blue'>...</span>",
    "text": "I am motivated to continuously learn new technologies and develop myself. My ability to solve complex problems and my passion for programming make me a valuable member for your team."
  },

  "my_skills": {
    "myskills": "My Skills",
    "learningHeadline": "I am currently learning",
    "learningContent": "Staying motivated to expand my IT skills requires a strategic approach, a curious mindset, and a commitment to lifelong learning."
  },

  "reviews": {
    "headline_one": "Do you need a team player?",
    "headline_two": "Listen to what my colleagues say about me",
    "review_one_name": "Dzmitry Stashkevich",
    "review_one_project": "Kochwelt",
    "review_one_review": "Martin impressed with his quick problem identification and clean code in the ‘Kochwelt’ project. His clear statements and communication skills supported the team. I would be happy to work with him again at any time.",
    "review_two_name": "Michael Spari",
    "review_two_project": "Kochwelt",
    "review_two_review": "Martin was a top team colleague at DA. His positive commitment and willingness to take on responsibility contributed greatly to us achieving our goals.",
    "review_three_name": "Philipp Franke",
    "review_three_project": "Join",
    "review_three_review": "Martin is a valuable team colleague who has significantly advanced the project with his conscientiousness and commitment. He always showed initiative and also took on tasks that were still open. His constructive and critical feedback helped the team to continuously improve. He remained open to suggestions for optimization and accepted them as an opportunity for further development. Even when errors were reported, he was not discouraged, but maintained his sense of humor and enjoyment of his work.",
    "review_four_name": "Normann Blum",
    "review_four_project": "Join",
    "review_four_review": "Working with Martin was a great experience! He works very precisely and has a great flair for solving complex problems in a structured way. He is also a real team player - open, humorous and always willing to share his knowledge. His analytical way of thinking and his solution-oriented work have enriched our collaboration enormously.",
    "review_five_name": "Dominik Marnet",
    "review_five_project": "Join",
    "review_five_review": "Working with Martin has been very good and efficient from day one. There is no doubt that he is a real workhorse, easily outperforming most of the younger team members. Martin has a very personable manner and has contributed greatly to the success of our project with his extensive coding knowledge and professional approach. You couldn't wish for a better team player!"
  },

  "contact": {
    "contact_headline": "Contact me",
    "contact_headline_two": "Let us work together!",
    "contact_content": "Still not sure if I am the right person for your project?<br>Whether your project involves developing a new application, upgrading existing systems, or implementing robust cybersecurity measures, I have the technical acumen and problem-solving skills to ensure successful outcomes.<br>Please feel free to contact me so that we can discuss everything together.",
    "contact_phone": "Tel: ",
    "contact_mail": "E-mail: ",
    "contact_name": "Your name ",
    "contact_name_error": "Your Name is required: ",
    "contact_Email": "Your E-mail ",
    "contact_mail_error": "Your Email is required: ",
    "contact_message": "Your message ",
    "contact_message_error": "Your Message is required: ",
    "privacy_policy_message_one": "I've read the ",
    "privacy_policy_message_two": " and agree to the processing of my data as outlined.",
    "privacy_policy_message_error": "Please accept the privacy policy.",
    "contact_btn_send": "Send",
    "contact_success_message": "Your message was sent successfully!"
  },

  "title": {
    "headline": "My Projects",
    "nav_title": "7. Ongoinig Project",
    "project1": "1. Projekt",
    "project2": "2. Project",
    "project3": "3. Project",
    "project4": "4. Project",
    "project5": "5. Project",
    "project6": "6. Project",
    "frontend_projects": "Frontend",
    "backend_projects": "Backend"
  },

  "project": {
    "project_title_pokedex": "Pokedex",
    "project_about_pokedex": "About the Project",
    "project_duration_pokedex": "Duration: 1 week",
    "project_about_text_pokedex": "The Pokedex Project is a collection and documentation of Pokémon, including information such as abilities, types, evolution, and origin of each Pokémon.",
    "project_organized_pokedex": "How I have organized my work process",
    "project_organized_text_pokedex": "1. What should my Pokedex contain? <br>2. Where do I get the data for my Pokedex? <br>3. What should the user interface look like. How should the information be displayed? How does the user navigate through the Pokedex? <br>4. Search function and filters: implement a search function to find Pokémon by name.",
    "project_experience_pokedex": "What have I learned?",
    "project_experience_text_pokedex": "The task was to develop a Pokémon trainer registry, learning how to use APIs to retrieve Pokémon characteristics and making systems compatible.",
    "icons_container_headline": "Technologies",
    "link_live_pokedex": "https://www.pokedex.martin-bock.info",
    "link_github_pokedex": "https://github.com/MartinBock1/Pokedex",

    "project_title_game": "El Pollo Loco",
    "project_about_game": "About the Project",
    "project_duration_game": "Duration: 3 weeks",
    "project_about_text_game": "Jump, run and throw game based on object-oriented approach. Help Pepe to find coins and tabasco salsa to fight against the crazy hen.",
    "project_organized_game": "How I have organized my work process",
    "project_organized_text_game": "After creating the basic framework as specified, further develop the canvas with the newly learned skills.",
    "project_experience_game": "What have I learned?",
    "project_experience_text_game": "Learning & applying advanced concepts such as object orientation (OOP), getting to know and using browser events, deepening JavaScript knowledge",
    "link_live_game": "https://www.elpolloloco.martin-bock.info",
    "link_github_game": "https://github.com/MartinBock1/El-Pollo-Loco",

    "project_title_join": "Join",
    "project_about_join": "About the Project",
    "project_duration_join": "Duration: 5 weeks",
    "project_about_text_join": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories.",
    "project_organized_join": "How I have organized my work process",
    "project_organized_text_join": "The project was splited into three sprints. The tasks were then divided up in a Kanban board, so everyone had to complete tasks alone, but some tasks were also completed in group work.",
    "project_experience_join": "My group work experience",
    "project_experience_text_join": "For my final project at the Developer Akademie, with 4 colleagues, we used Angular and Firebase (Angular Fire). My main tasks included entering, processing, and storing contact data, as well as new tasks. I also used Firebase for authentication and data storage.",
    "link_live_join": "https://www.join.martin-bock.info/",
    "link_github_join": "https://github.com/MartinBock1/Join",

    "project_title_kanmind": "KanMind",
    "project_about_kanmind": "About the Project",
    "project_duration_kanmind": "Duration: 2 weeks",
    "project_about_text_kanmind": "KanMind is a project management application based on the Kanban methodology that is controlled via a RESTful API. It enables teams to organize projects into boards, manage tasks with status, priority and assignments and collaborate via comments. The API covers the entire logic from user authentication, board and task management to collaborative communication.",
    "project_organized_kanmind": "How I have organized my work process",
    "project_organized_text_kanmind": "I structured the workflow logically according to the dependencies of the data models, starting with the fundamental user authentication for registration and login. Building on this, I developed the complete logic for the boards, as these form the central organizational unit. Finally, I implemented the dependent functions for tasks and comments to cover the entire workflow from registration to collaboration on a task.",
    "project_experience_kanmind": "What have I learned?",
    "project_experience_text_kanmind": "In developing this backend, I learned to design a complex and secure RESTful API from scratch and implement it according to best practices. A central focus was on implementing a robust authentication and authorization system that precisely controls access to resources according to user roles such as owner or member. I also honed my skills in modeling data structures with complex relationships and creating efficient database queries.",
    "link_live_kanmind": "https://www.kanmind.martin-bock.info",
    "link_github_kanmind": "https://github.com/MartinBock1/KanMind-Backend",

    "project_title_coderr": "Coderr",
    "project_about_coderr": "About the Project",
    "project_duration_coderr": "Duration: 4 weeks",
    "project_about_text_coderr": "I developed the backend for ‘Coderr’, a freelancer and service platform that acts as a central interface between providers and customers. The API implements a complete business logic for managing profiles, multi-level quotes, orders and a rating system. A core feature is the detailed, role-based authorization system that ensures the integrity and security of all actions on the platform.",
    "project_organized_coderr": "How I have organized my work process",
    "project_organized_text_coderr": "I consistently organized the entire development process according to the Test-Driven Development (TDD) methodology. For each function - from user authentication to ordering logic - I first wrote a failing test that precisely defined the expected behavior and permissions. This approach forced me to design the application logic from the user's perspective and organically led to a robust, well-tested and maintainable code base.",
    "project_experience_coderr": "What have I learned?",
    "project_experience_text_coderr": "Through the consistent application of Test-Driven Development, I have learned how to translate complex business logic into a clean and intuitive API structure. I significantly deepened my skills in dealing with nested data structures in proposal generation as well as in optimizing database queries for sophisticated filtering and aggregation endpoints. Ultimately, the project showed me how TDD not only ensures code quality, but also leads to better and more thoughtful API design.",
    "link_live_coderr": "https://www.coderr.martin-bock.info",
    "link_github_coderr": "https://github.com/MartinBock1/Coderr",

    "project_title_videoflix": "Videoflix",
    "project_about_videoflix": "About the Project",
    "project_duration_videoflix": "Duration: 5 weeks",
    "project_about_text_videoflix": "",
    "project_organized_videoflix": "How I have organized my work process",
    "project_organized_text_videoflix": "",
    "project_experience_videoflix": "What have I learned?",
    "project_experience_text_videoflix": "",
    "link_live_videoflix": "https://www.martin-bock.info",
    "link_github_videoflix": "https://github.com/MartinBock1/",

    "project_title_ongoinig": "Ongoinig Project",
    "project_about_ongoinig": "About the Project",
    "project_duration_ongoinig": "",
    "project_about_text_ongoinig": "I am currently working on developing a Simple Customer Relationship Management system working with CRUD functionality. This is for me both exciting and challenging. In my work the key to success lies in a good planning and execution.ize tasks using drag and drop functions, assign users and categories. ",
    "project_organized_ongoinig": "",
    "project_organized_text_ongoinig": "",
    "project_experience_ongoinig": "",
    "project_experience_text_ongoinig": "",
    "link_live_ongoinig": "",
    "link_github_ongoinig": ""
  },

  "footer": {
    "legal_notice": "Legal Notice",
    "privacy_policy": "Privacy Policy"
  },

  "legalnotices": {
    "headline": "Legal Notice",
    "name": "Martin Bock<br>Becherweg 30<br>13407 Berlin<br>Germany",
    "contact_headline": "Contact",
    "contact_mail_phone": "phone: +49 30 81473698<br>email-Adress: kontakt&#64;martin-bock.info",
    "picture_headline": "Image credits",
    "picture_text": "<strong>The image rights are held by: </strong>",
    "legal_source": "Source: Created with the <a href='https://www.adsimple.de/impressum-generator/' title='Impressum Generator Deutschland von AdSimple'>Legal Notice Generator Germany</a> from AdSimple",
    "mainpage": "home"
  },

  "privacypolicy": {
    "headline": "Privacy Policy",
    "text_block_one": "Personal data (usually referred to just as „data“ below) will only be processed by us to the extent necessary and for the purpose of roviding a functional and user-friendly website, including its contents, and the services offered there. Per Art. 4 No. 1 of Regulation (EU) 2016/679, i.e.the General Data Protection Regulation (hereinafter referred to as the „GDPR“), „processing“ refers to any operation or set of operations such as collection, recording, organization, structuring, storage, adaptation, alteration, retrieval, consultation, use, disclosure by transmission, dissemination,or otherwise making available, alignment, or combination, restriction, erasure, or destruction performed on personal data, whether by automated means or not. The following privacy policy is intended to inform you in particular about the type, scope, purpose, duration, and legal basis for the processing of such data either under our own control or in conjunction with others. We also inform you below about the third-party components we use to optimize our website and improve the user experience which may result in said third parties also processing data they collect and control.",
    "structure": "Our privacy policy is structured as follows:<br>I. Information about us as controllers of your data<br>II. The rights of users and data subjects<br>III. Information about the data processing",
    "structure_one_headline": "I. Information about us as controllers of your data",
    "structure_one": "The party responsible for this website (the „controller“) for purposes of data protection law is:<br>Martin Bock<br>Becherweg 30<br>13407 Berlin<br><br>Telefon: +49 30 81473698<br>E-Mail: kontakt&#64;martin-bock.info",
    "structure_two_headline": "II. The rights of users and data subjects",
    "structure_two": "With regard to the data processing to be described in more detail below, users and data subjects have the right<br><ul><li>to confirmation of whether data concerning them is being processed, information about the data being processed, further information about the nature of the data processing, and copies of the data (cf. also Art. 15 GDPR)</li><li>to correct or complete incorrect or incomplete data (cf. also Art. 16 GDPR)</li><li>to the immediate deletion of data concerning them (cf. also Art. 17 DSGVO), or, alternatively, if further processing is necessary as stipulated in Art. 17 Para. 3 GDPR, to restrict said processing per Art. 18 GDPR</li><li>to receive copies of the data concerning them and/or provided by them and to have the same transmitted to other providers/controllers (cf. also Art. 20 GDPR)</li><li>to file complaints with the supervisory authority if they believe that data concerning them is being processed by the controller in breach of data protection provisions (see also Art. 77 GDPR).</li></ul><br>In addition, the controller is obliged to inform all recipients to whom it discloses data of any such corrections, deletions, or restrictions placed on processing the same per Art. 16, 17 Para. 1, 18 GDPR. However, this obligation does not apply if such notification is impossible or involves a disproportionate effort. Nevertheless, users have a right to information about these recipients.<br><strong>Likewise, under Art. 21 GDPR, users and data subjects have the right to object to the controller’s future processing of their data pursuant to Art. 6 Para. 1 (lit. f) GDPR. In particular, an objection to data processing for the purpose of direct advertising is permissible.</strong>",
    "structure_three_headline": "III. Information about the data processing",
    "structure_three": "Your data processed when using our website will be deleted or blocked as soon as the purpose for its storage ceases to apply, provided the deletion of the same is not in breach of any statutory storage obligations or unless otherwise stipulated below.",
    "contact_headline": "Contact",
    "contact": "If you contact us via email or the contact form, the data you provide will be used for the purpose of processing your request. We must have this data in order to process and answer your inquiry; otherwise we will not be able to answer it in full or at all.<br>The legal basis for this data processing is Art. 6 Para. 1 lit. b) GDPR.<br>Your data will be deleted once we have fully answered your inquiry and there is no further legal obligation to store your data, such as if an order or contract resulted therefrom.",
    "linkedin_headline": "LinkedIn",
    "linkedin": "LinkedIn Ireland Unlimited Company, Wilton Plaza, Wilton Place, Dublin 2, Irland, a subsidiary of LinkedIn Corporation, 1000 W. Maude Avenue, Sunnyvale, CA 94085 USA.<br> Privacy Policy: <a href='https://www.linkedin.com/legal/privacy-policy' target='_blank' rel='noopener nofollow'>https://www.linkedin.com/legal/privacy-policy</a>",
    "lawer": "<a href='https://www.generator-datenschutzerklärung.de' target='_blank' rel='noopener'>Model Data Protection Statement</a> der <a href='https://www.bewertung-löschen24.de' rel='nofollow noopener' target='_blank'>Anwaltskanzlei Weiß &amp; Partner</a>",
    "mainpage": "home"
  }
}
